sorosaulong-ux/gd32-test-project/Library/gd32a7xx.h
/*!
    \file    gd32a7xx.h
    \brief   general definitions for GD32A7xx

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_H
#define GD32A7XX_H

#ifdef __cplusplus
 extern "C" {
#endif 

#if !defined (GD32A711X_A712X) && !defined (GD32A714X) && !defined (GD32A72XX) && !defined (GD32A74XX)
#error "Please select the target GD32A7XX device used in your application (in gd32a7xx.h file)"
#endif /* undefine GD32A7XX tip */

/* define value of high speed crystal oscillator (HXTAL) in Hz */
#if !defined  HXTAL_VALUE
#define HXTAL_VALUE    ((uint32_t)25000000) /*!< value of the external oscillator in Hz */
#endif /* high speed crystal oscillator value */

/* define startup timeout value of high speed crystal oscillator (HXTAL) */
#if !defined  (HXTAL_STARTUP_TIMEOUT)
#define HXTAL_STARTUP_TIMEOUT   ((uint16_t)0x0FFFF)
#endif /* high speed crystal oscillator startup timeout */

/* define value of internal 48MHz RC oscillator (IRC48M) in Hz */
#if !defined  (IRC48M_VALUE) 
#define IRC48M_VALUE  ((uint32_t)48000000)
#endif /* internal 48MHz RC oscillator value */

/* define startup timeout value of internal 48MHz RC oscillator (IRC48M) */
#if !defined  (IRC48M_STARTUP_TIMEOUT)
#define IRC48M_STARTUP_TIMEOUT   ((uint16_t)0x0500)
#endif /* internal 48MHz RC oscillator startup timeout */

/* define value of internal 40KHz RC oscillator(IRC40K) in Hz */
#if !defined  (IRC40K_VALUE) 
#define IRC40K_VALUE  ((uint32_t)40000)
#endif /* internal 40KHz RC oscillator value */

/* define value of low speed crystal oscillator (LXTAL)in Hz */
#if !defined  (LXTAL_VALUE) 
#define LXTAL_VALUE  ((uint32_t)32768)
#endif /* low speed crystal oscillator value */

/* GD32A7xx firmware library version number */
#define GD32A7XX_STDPERIPH_VERSION_MAIN   (0x00) /*!< [31:24] main version */
#define GD32A7XX_STDPERIPH_VERSION_SUB1   (0x01) /*!< [23:16] sub1 version */
#define GD32A7XX_STDPERIPH_VERSION_SUB2   (0x00) /*!< [15:8]  sub2 version */
#define GD32A7XX_STDPERIPH_VERSION_RC     (0x00) /*!< [7:0]  release candidate */ 
#define GD32A7XX_STDPERIPH_VERSION        ((GD32A7XX_STDPERIPH_VERSION_MAIN << 24)\
                                            |(GD32A7XX_STDPERIPH_VERSION_SUB1 << 16)\
                                            |(GD32A7XX_STDPERIPH_VERSION_SUB2 << 8)\
                                            |(GD32A7XX_STDPERIPH_VERSION_RC))

/* configuration of the Cortex-M7 processor and core peripherals                                           */
#define __CM7_REV                 0x0102U   /*!< Core revision r1p2                                        */
#define __SAUREGION_PRESENT       0U        /*!< SAU regions are not present                               */
#define __MPU_PRESENT             1U        /*!< MPU is present                                            */
#define __VTOR_PRESENT            1U        /*!< VTOR is present                                           */
#define __NVIC_PRIO_BITS          4U        /*!< Number of Bits used for Priority Levels                   */
#define __Vendor_SysTickConfig    0U        /*!< Set to 1 if different SysTick Config is used              */
#define __FPU_PRESENT             1U        /*!< FPU present                                               */
#define __DSP_PRESENT             1U        /*!< DSP present                                               */
#define __ICACHE_PRESENT          1U        /*!< CM7 instruction cache present                             */
#define __DCACHE_PRESENT          1U        /*!< CM7 data cache present                                    */

/* define interrupt number */
typedef enum IRQn
{
    /* Cortex-M7 processor exceptions numbers */
    NonMaskableInt_IRQn         = -14,      /*!< non mask-able interrupt                                        */
    HardFault_IRQn              = -13,      /*!< hard-fault interrupt                                           */
    MemoryManagement_IRQn       = -12,      /*!< Cortex-M7 memory management interrupt                          */
    BusFault_IRQn               = -11,      /*!< Cortex-M7 bus fault interrupt                                  */
    UsageFault_IRQn             = -10,      /*!< Cortex-M7 usage fault interrupt                                */
    SVCall_IRQn                 = -5,       /*!< Cortex-M7 sv call interrupt                                    */
    DebugMonitor_IRQn           = -4,       /*!< Cortex-M7 debug monitor interrupt                              */
    PendSV_IRQn                 = -2,       /*!< Cortex-M7 pend sv interrupt                                    */
    SysTick_IRQn                = -1,       /*!< Cortex-M7 system tick interrupt                                */
    /* interrupt numbers */
    WWDGT0_IRQn                 = 0,        /*!< window watchdog 0 interrupt                                    */
    HVD_LVD_IRQn                = 1,        /*!< LVD through EXTI line detect interrupt                         */
    RTC_Alarm_IRQn              = 2,        /*!< RTC Alarm interrupt through EXTI line                          */
    RTC_IRQn                    = 3,        /*!< RTC interrupt                                                  */
    FMC_IRQn                    = 4,        /*!< FMC interrupt                                                  */
    RCU_IRQn                    = 5,        /*!< RCU and CTC interrupt                                          */
    EXTI0_IRQn                  = 6,        /*!< EXTI line 0 interrupts                                         */
    EXTI1_IRQn                  = 7,        /*!< EXTI line 1 interrupts                                         */
    EXTI2_IRQn                  = 8,        /*!< EXTI line 2 interrupts                                         */
    EXTI3_IRQn                  = 9,        /*!< EXTI line 3 interrupts                                         */
    EXTI4_IRQn                  = 10,       /*!< EXTI line 4 interrupts                                         */
    DMA0_Channel0_IRQn          = 11,       /*!< DMA0 channel 0 interrupt                                       */
    DMA0_Channel1_IRQn          = 12,       /*!< DMA0 channel 1 interrupt                                       */
    DMA0_Channel2_IRQn          = 13,       /*!< DMA0 channel 2 interrupt                                       */
    DMA0_Channel3_IRQn          = 14,       /*!< DMA0 channel 3 interrupt                                       */
    DMA0_Channel4_IRQn          = 15,       /*!< DMA0 channel 4 interrupt                                       */
    DMA0_Channel5_IRQn          = 16,       /*!< DMA0 channel 5 interrupt                                       */
    DMA0_Channel6_IRQn          = 17,       /*!< DMA0 channel 6 interrupt                                       */
    ADC0_IRQn                   = 18,       /*!< ADC0_1 interrupts                                              */
    DTM_CAN0_INT0_IRQn          = 19,       /*!< DTM_CAN0 interrupt 0                                           */
    DTM_CAN0_INT1_IRQn          = 20,       /*!< DTM_CAN0 interrupt 1                                           */
#ifdef GD32A711X_A712X
    DTM_CAN0_DMU_IRQn           = 25,       /*!< DTM_CAN0 DMU interrupt                                         */
    TIMER0_BRK_UP_TRG_CMT_IRQn  = 26,       /*!< TIMER0 break, update, trigger and commutation interrupt        */
    TIMER2_IRQn                 = 27,       /*!< TIMER2 interrupt                                               */
    TIMER1_IRQn                 = 28,       /*!< TIMER1 interrupt                                               */
    TIMER19_BRK_UP_TRG_CMT_IRQn = 29,       /*!< TIMER19 break, update, trigger and commutation interrupt       */
    JDC_IRQn                    = 30,       /*!< JDC interrupt to host */
    I2C0_EV_IRQn                = 31,       /*!< I2C0 event interrupt                                           */
    I2C0_ER_IRQn                = 32,       /*!< I2C0 error interrupt                                           */
    I2C1_EV_IRQn                = 33,       /*!< I2C1 event interrupt                                           */
    I2C1_ER_IRQn                = 34,       /*!< I2C1 error interrupt                                           */
    SPI0_IRQn                   = 35,       /*!< SPI0 interrupt                                                 */
    SPI1_IRQn                   = 36,       /*!< SPI1 interrupt                                                 */
    EXTI10_15_IRQn              = 40,       /*!< EXTI line 10 to 15 interrupts                                  */
    EXTI5_9_IRQn                = 41,       /*!< EXTI line 5 to 9 interrupts                                    */
    TAMPER_IRQn                 = 42,       /*!< BKP Tamper interrupt                                           */
    TIMER20_BRK_UP_TRG_CMT_IRQn = 43,       /*!< TIMER20 break, update, trigger and commutation interrupt       */
    EXTI42_101_IRQn             = 44,       /*!< EXTI line 42 to 101 interrupts                                 */
    TIMER7_BRK_UP_TRG_CMT_IRQn  = 45,       /*!< TIMER7 break, update, trigger and commutation interrupt        */
    PLL_LOL_DES_RESET_IRQn      = 46,       /*!< PLL LOL destructive reset interrupt                            */
    DMAMUX_OVR_IRQn             = 47,       /*!< DMAMUX overrun interrupt                                       */
    FPU_WAB_IRQn                = 48,       /*!< CPU FPU interrupt or Write abort interrupt                     */
    CMP0_EXTI_IRQn              = 49,       /*!< CMP0 through EXTI Line detection interrupt                     */
    CMP1_EXTI_IRQn              = 50,       /*!< CMP1 through EXTI Line detection interrupt                     */
    FMU_INIT_IRQn               = 51,       /*!< FMU initializing timeout interrupt                             */
    ADC1_IRQn                   = 52,       /*!< ADC1 interrupt                                                 */
    DAC0_IRQn                   = 54,       /*!< DAC0 global interrupt                                          */
    STCM_IRQn                   = 55,       /*!< STCM illegal triggered during running state                    */
    DMA1_Channel0_IRQn          = 56,       /*!< DMA1 channel 0 interrupt                                       */
    DMA1_Channel1_IRQn          = 57,       /*!< DMA1 channel 1 interrupt                                       */
    DMA1_Channel2_IRQn          = 58,       /*!< DMA1 channel 2 interrupt                                       */
    DMA1_Channel3_IRQn          = 59,       /*!< DMA1 channel 3 interrupt                                       */
    DMA1_Channel4_IRQn          = 60,       /*!< DMA1 channel 4 interrupt                                       */
    DTM_CAN1_INT0_IRQn          = 62,       /*!< DTM_CAN1 interrupt 0                                           */
    DTM_CAN1_INT1_IRQn          = 63,       /*!< DTM_CAN1 interrupt 1                                           */
    DTM_CAN1_DMU_IRQn           = 64,       /*!< DTM_CAN1 DMU interrupt                                         */
    CTI0_IRQn                   = 65,       /*!< CTI Interrupt 0                                                */
    CTI1_IRQn                   = 66,       /*!< CTI Interrupt 1                                                */
    CAN0_ECCERR_IRQn            = 67,       /*!< CAN0 ECC error interrupt                                       */
    CAN1_ECCERR_IRQn            = 68,       /*!< CAN1 ECC error interrupt                                       */
    CAN2_ECCERR_IRQn            = 69,       /*!< CAN2 ECC error interrupt                                       */
    CMP0_IRQn                   = 71,       /*!< CMP0 global interrupt                                          */
    CMP1_IRQn                   = 72,       /*!< CMP1 global interrupt                                          */
    DAC1_IRQn                   = 78,       /*!< DAC1 global interrupt                                          */
    HSM_COM0_IRQn               = 79,       /*!< HSM communication interrupt 0                                  */
    HSM_COM1_IRQn               = 80,       /*!< HSM communication interrupt 1                                  */
    FMU_CAT_IRQn                = 81,       /*!< FMU cation state interrupt request                             */
    RCTL_IRQn                   = 82,       /*!< RCTL interrupt                                                 */
    SPI2_IRQn                   = 84,       /*!< SPI2 global interrupt                                          */
    SPI3_IRQn                   = 85,       /*!< SPI3 global interrupt                                          */
    SPI4_IRQn                   = 86,       /*!< SPI4 global interrupt                                          */
    SPI5_IRQn                   = 87,       /*!< SPI5 global interrupt                                          */
    QSPI_IRQn                   = 90,       /*!< QSPI global interrupt                                          */
    DTM_CAN2_DMU_IRQn           = 94,       /*!< DTM_CAN2_DMU interrupt                                         */
    DTM_CAN3_DMU_IRQn           = 95,       /*!< DTM_CAN3_DMU interrupt                                         */
    DTM_CAN4_DMU_IRQn           = 96,       /*!< DTM_CAN4_DMU interrupt                                         */
    DTM_CAN5_DMU_IRQn           = 97,       /*!< DTM_CAN5_DMU interrupt                                         */
    DTM_CAN6_DMU_IRQn           = 98,       /*!< DTM_CAN6_DMU interrupt                                         */
    DTM_CAN7_DMU_IRQn           = 99,       /*!< DTM_CAN7_DMU interrupt                                         */
    DTM_CAN2_INT0_IRQn          = 100,      /*!< DTM_CAN2 interrupt 0                                           */
    DTM_CAN2_INT1_IRQn          = 101,      /*!< DTM_CAN2 interrupt 1                                           */
    DTM_CAN3_INT0_IRQn          = 102,      /*!< DTM_CAN3 interrupt 0                                           */
    DTM_CAN3_INT1_IRQn          = 103,      /*!< DTM_CAN3 interrupt 1                                           */
    DTM_CAN4_INT0_IRQn          = 104,      /*!< DTM_CAN4 interrupt 0                                           */
    DTM_CAN4_INT1_IRQn          = 105,      /*!< DTM_CAN4 interrupt 1                                           */
    DTM_CAN5_INT0_IRQn          = 106,      /*!< DTM_CAN5 interrupt 0                                           */
    DTM_CAN5_INT1_IRQn          = 107,      /*!< DTM_CAN5 interrupt 1                                           */
    DTM_CAN6_INT0_IRQn          = 108,      /*!< DTM_CAN6 interrupt 0                                           */
    DTM_CAN6_INT1_IRQn          = 109,      /*!< DTM_CAN6 interrupt 1                                           */
    DTM_CAN7_INT0_IRQn          = 110,      /*!< DTM_CAN7 interrupt 0                                           */
    DTM_CAN7_INT1_IRQn          = 111,      /*!< DTM_CAN7 interrupt 1                                           */
    TIMER19_CC0_CC0N_IRQn       = 112,      /*!< TIMER19 capture compare CH0 and MCH0 interrupt                 */
    TIMER19_CC1_CC1N_IRQn       = 113,      /*!< TIMER19 capture compare CH1 and MCH1 interrupt                 */
    TIMER19_CC2_CC2N_IRQn       = 114,      /*!< TIMER19 capture compare CH2 and MCH2 interrupt                 */
    TIMER19_CC3_CC3N_IRQn       = 115,      /*!< TIMER19 capture compare CH3 and MCH3 interrupt                 */
    TIMER20_CC0_CC0N_IRQn       = 116,      /*!< TIMER20 capture compare CH0 and MCH0 interrupt                 */
    TIMER20_CC1_CC1N_IRQn       = 117,      /*!< TIMER20 capture compare CH1 and MCH1 interrupt                 */
    TIMER20_CC2_CC2N_IRQn       = 118,      /*!< TIMER20 capture compare CH2 and MCH2 interrupt                 */
    TIMER20_CC3_CC3N_IRQn       = 119,      /*!< TIMER20 capture compare CH3 and MCH3 interrupt                 */
    TIMER60_CC0_CC0N_IRQn       = 120,      /*!< TIMER60 capture compare CH0 and MCH0 interrupt                 */
    TIMER60_CC1_CC1N_IRQn       = 121,      /*!< TIMER60 capture compare CH1 and MCH1 interrupt                 */
    TIMER60_CC2_CC2N_IRQn       = 122,      /*!< TIMER60 capture compare CH2 and MCH2 interrupt                 */
    TIMER60_CC3_CC3N_IRQn       = 123,      /*!< TIMER60 capture compare CH3 and MCH3 interrupt                 */
    TIMER61_CC0_CC0N_IRQn       = 124,      /*!< TIMER61 capture compare CH0 and MCH0 interrupt                 */
    TIMER61_CC1_CC1N_IRQn       = 125,      /*!< TIMER61 capture compare CH1 and MCH1 interrupt                 */
    TIMER61_CC2_CC2N_IRQn       = 126,      /*!< TIMER61 capture compare CH2 and MCH2 interrupt                 */
    TIMER61_CC3_CC3N_IRQn       = 127,      /*!< TIMER61 capture compare CH3 and MCH3 interrupt                 */
    TIMER62_CC0_CC0N_IRQn       = 128,      /*!< TIMER62 capture compare CH0 and MCH0 interrupt                 */
    TIMER62_CC1_CC1N_IRQn       = 129,      /*!< TIMER62 capture compare CH1 and MCH1 interrupt                 */
    TIMER62_CC2_CC2N_IRQn       = 130,      /*!< TIMER62 capture compare CH2 and MCH2 interrupt                 */
    TIMER62_CC3_CC3N_IRQn       = 131,      /*!< TIMER62 capture compare CH3 and MCH3 interrupt                 */
    TIMER63_CC0_CC0N_IRQn       = 132,      /*!< TIMER64 capture compare CH0 and MCH0 interrupt                 */
    TIMER63_CC1_CC1N_IRQn       = 133,      /*!< TIMER64 capture compare CH1 and MCH1 interrupt                 */
    TIMER63_CC2_CC2N_IRQn       = 134,      /*!< TIMER64 capture compare CH2 and MCH2 interrupt                 */
    TIMER63_CC3_CC3N_IRQn       = 135,      /*!< TIMER64 capture compare CH3 and MCH3 interrupt                 */
    DMA0_Channel7_IRQn          = 136,      /*!< DMA0 Channel7 global interrupt                                 */
    DMA1_Channel5_IRQn          = 145,      /*!< DMA1 Channel5 global interrupt                                 */
    DMA1_Channel6_IRQn          = 146,      /*!< DMA1 Channel6 global interrupt                                 */
    DMA1_Channel7_IRQn          = 147,      /*!< DMA1 Channel7 global interrupt                                 */
    LINFlexD0_IRQn              = 162,      /*!< LINFlexD0 interrupt                                            */
    LINFlexD1_IRQn              = 163,      /*!< LINFlexD1 interrupt                                            */
    LINFlexD2_IRQn              = 164,      /*!< LINFlexD2 interrupt                                            */
    LINFlexD3_IRQn              = 165,      /*!< LINFlexD3 interrupt                                            */
    LINFlexD4_IRQn              = 166,      /*!< LINFlexD4 interrupt                                            */
    LINFlexD5_IRQn              = 167,      /*!< LINFlexD5 interrupt                                            */
    TIMER0_CC0_CC0N_IRQn        = 174,      /*!< TIMER0 Capture Compare CH0 and MCH0 interrupt                  */
    TIMER0_CC1_CC1N_IRQn        = 175,      /*!< TIMER0 Capture Compare CH1 and MCH1 interrupt                  */
    TIMER0_CC2_CC2N_IRQn        = 176,      /*!< TIMER0 Capture Compare CH2 and MCH3 interrupt                  */
    TIMER0_CC3_CC3N_IRQn        = 177,      /*!< TIMER0 Capture Compare CH4 and MCH4 interrupt                  */
    TIMER7_CC0_CC0N_IRQn        = 178,      /*!< TIMER7 Capture Compare CH0 and MCH0 interrupt                  */
    TIMER7_CC1_CC1N_IRQn        = 179,      /*!< TIMER7 Capture Compare CH1 and MCH1 interrupt                  */
    TIMER7_CC2_CC2N_IRQn        = 180,      /*!< TIMER7 Capture Compare CH2 and MCH3 interrupt                  */
    TIMER7_CC3_CC3N_IRQn        = 181,      /*!< TIMER7 Capture Compare CH4 and MCH4 interrupt                  */
    TIMER1_CC0_IRQn             = 182,      /*!< TIMER1 Capture Compare CH0 and MCH0 interrupt                  */
    TIMER1_CC1_IRQn             = 183,      /*!< TIMER1 Capture Compare CH1 and MCH1 interrupt                  */
    TIMER1_CC2_IRQn             = 184,      /*!< TIMER1 Capture Compare CH2 and MCH3 interrupt                  */
    TIMER1_CC3_IRQn             = 185,      /*!< TIMER1 Capture Compare CH4 and MCH4 interrupt                  */
    TIMER2_CC0_IRQn             = 186,      /*!< TIMER2 Capture Compare CH0 and MCH0 interrupt                  */
    TIMER2_CC1_IRQn             = 187,      /*!< TIMER2 Capture Compare CH1 and MCH1 interrupt                  */
    TIMER2_CC2_IRQn             = 188,      /*!< TIMER2 Capture Compare CH2 and MCH3 interrupt                  */
    TIMER2_CC3_IRQn             = 189,      /*!< TIMER2 Capture Compare CH4 and MCH4 interrupt                  */
    FWDGT_IRQn                  = 190,      /*!< FWDGT reset interrupt through EXTI Line detection interrupt    */
    RCU_CK_FAIL_IRQn            = 196,      /*!< RCU clock fail interrupt                                       */
    TIMER60_BRK_UP_TRG_CMT_IRQn = 210,      /*!< TIMER60 Break, update, trigger and commutation, dec interrupt  */
    TIMER61_BRK_UP_TRG_CMT_IRQn = 211,      /*!< TIMER61 Break, update, trigger and commutation, dec interrupt  */
    TIMER62_BRK_UP_TRG_CMT_IRQn = 212,      /*!< TIMER62 Break, update, trigger and commutation, dec interrupt  */
    TIMER63_BRK_UP_TRG_CMT_IRQn = 213,      /*!< TIMER63 Break, update, trigger and commutation, dec interrupt  */
    TIMER5_CH0_UP_IRQn          = 214,      /*!< TIMER5 CH0 update interrupt                                    */
    TIMER5_CH1_UP_IRQn          = 215,      /*!< TIMER5 CH1 update interrupt                                    */
    TIMER5_CH2_UP_IRQn          = 216,      /*!< TIMER5 CH2 update interrupt                                    */
    TIMER5_CH3_UP_IRQn          = 217,      /*!< TIMER5 CH3 update interrupt                                    */
    TIMER6_CH0_UP_IRQn          = 218,      /*!< TIMER6 CH0 update interrupt                                    */
    TIMER6_CH1_UP_IRQn          = 219,      /*!< TIMER6 CH1 update interrupt                                    */
    TIMER6_CH2_UP_IRQn          = 220,      /*!< TIMER6 CH2 update interrupt                                    */
