sorosaulong-ux/gd32-test-project/Library/gd32a7xx.h
    TIMER6_CH3_UP_IRQn          = 221,      /*!< TIMER6 CH3 update interrupt                                    */
#endif /* GD32A711X_A712X */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    CPU_INT0_IRQn               = 21,       /* Interrupt 0 between CM7_0 and CM7_1                              */
    CPU_INT1_IRQn               = 22,       /* Interrupt 1 between CM7_0 and CM7_1                              */
    CPU_INT2_IRQn               = 23,       /* Interrupt 2 between CM7_0 and CM7_1                              */
    CPU_INT3_IRQn               = 24,       /* Interrupt 3 between CM7_0 and CM7_1                              */
    CAN0_WKUP_IRQn              = 25,       /*!< CAN0 wakeup through EXTI Line detection interrupt              */
    TIMER0_BRK_UP_TRG_CMT_IRQn  = 26,       /*!< TIMER0 break, update, trigger and commutation interrupt        */
    TIMER2_IRQn                 = 27,       /*!< TIMER2 interrupt                                               */
    TIMER1_IRQn                 = 28,       /*!< TIMER1 interrupt                                               */
    TIMER19_BRK_UP_TRG_CMT_IRQn = 29,       /*!< TIMER19 break, update, trigger and commutation interrupt       */
    JDC_IRQn                    = 30,       /*!< JDC interrupt to host                                         */
    I2C0_EV_IRQn                = 31,       /*!< I2C0 event interrupt                                           */
    I2C0_ER_IRQn                = 32,       /*!< I2C0 error interrupt                                           */
    I2C1_EV_IRQn                = 33,       /*!< I2C1 event interrupt                                           */
    I2C1_ER_IRQn                = 34,       /*!< I2C1 error interrupt                                           */
    SPI0_IRQn                   = 35,       /*!< SPI0 interrupt                                                 */
    SPI1_IRQn                   = 36,       /*!< SPI1 interrupt                                                 */
    USART0_IRQn                 = 37,       /*!< USART0 interrupt                                               */
    USART1_IRQn                 = 38,       /*!< USART1 interrupt                                               */
    USART2_IRQn                 = 39,       /*!< USART2 interrupt                                               */
    EXTI10_15_IRQn              = 40,       /*!< EXTI line 10 to 15 interrupts                                  */
    EXTI5_9_IRQn                = 41,       /*!< EXTI line 5 to 9 interrupts                                    */
    TAMPER_IRQn                 = 42,       /*!< BKP Tamper interrupt                                           */
    TIMER20_BRK_UP_TRG_CMT_IRQn = 43,       /*!< TIMER20 break, update, trigger and commutation interrupt       */
    EXTI42_101_IRQn             = 44,       /*!< EXTI line 42 to 101 interrupts                                 */
    TIMER7_BRK_UP_TRG_CMT_IRQn  = 45,       /*!< TIMER7 break, update, trigger and commutation interrupt        */
    PLL_LOL_DES_RESET_IRQn      = 46,       /*!< PLL LOL system reset interrupt                                 */
    DMAMUX_OVR_IRQn             = 47,       /*!< DMAMUX overrun interrupt                                       */
    FPU_WAB_IRQn                = 48,       /*!< CPU FPU interrupt or Write abort interrupt                     */
    CMP0_EXTI_IRQn              = 49,       /*!< CMP0 through EXTI Line detection interrupt                     */
    CMP1_EXTI_IRQn              = 50,       /*!< CMP1 through EXTI Line detection interrupt                     */
    FMU_INIT_IRQn               = 51,       /*!< FMU initializing timeout interrupt                             */
    ADC1_IRQn                   = 52,       /*!< ADC1 interrupt                                                 */
    ADC2_IRQn                   = 53,       /*!< ADC2 interrupt                                                 */
    DAC0_IRQn                   = 54,       /*!< DAC0 global interrupt                                          */
    STCM_IRQn                   = 55,       /*!< STCM illegal triggered during running state                    */
    DMA1_Channel0_IRQn          = 56,       /*!< DMA1 channel 0 interrupt                                       */
    DMA1_Channel1_IRQn          = 57,       /*!< DMA1 channel 1 interrupt                                       */
    DMA1_Channel2_IRQn          = 58,       /*!< DMA1 channel 2 interrupt                                       */
    DMA1_Channel3_IRQn          = 59,       /*!< DMA1 channel 3 interrupt                                       */
    DMA1_Channel4_IRQn          = 60,       /*!< DMA1 channel 4 interrupt                                       */
    WWDGT1_IRQn                 = 61,       /*!< WWDGT1 interrupt                                               */
    CAN1_WKUP_IRQn              = 62,       /*!< CAN1 wakeup through EXTI Line detection interrupt              */
    CAN1_Message_IRQn           = 63,       /*!< CAN1 message buffer interrupt                                  */
    CAN1_IRQn                   = 64,       /*!< CAN1 interrupt                                                 */
    CTI0_IRQn                   = 65,       /*!< CTI Interrupt 0                                                */
    CTI1_IRQn                   = 66,       /*!< CTI Interrupt 1                                                */
    CAN0_ECCERR_IRQn            = 67,       /*!< CAN0 ECC error interrupt                                       */
    CAN1_ECCERR_IRQn            = 68,       /*!< CAN1 ECC error interrupt                                       */
    CAN2_ECCERR_IRQn            = 69,       /*!< CAN2 ECC error interrupt                                       */
    MFCOM_IRQn                  = 70,       /*!< MFCOM interrupt                                                */
    CMP0_IRQn                   = 71,       /*!< CMP0 global interrupt                                          */
    CMP1_IRQn                   = 72,       /*!< CMP1 global interrupt                                          */
    SENT_IRQn                   = 74,       /*!< SENT interrupt                                                 */
    HWSEM_IRQn                  = 75,       /*!< HWSEM global interrupt                                         */
    CAN3_ECCERR_IRQn            = 76,       /*!< CAN3 ECC error interrupt                                       */
    CAN4_ECCERR_IRQn            = 77,       /*!< CAN4 ECC error interrupt                                       */
    DAC1_IRQn                   = 78,       /*!< DAC1 global interrupt                                          */
    HSM_COM0_IRQn               = 79,       /*!< HSM communication interrupt 0                                  */
    HSM_COM1_IRQn               = 80,       /*!< HSM communication interrupt 1                                  */
    FMU_CAT_IRQn                = 81,       /*!< FMU cation timeout interrupt                                   */
    RCTL_IRQn                   = 82,       /*!< RCTL interrupt                                                 */
    IOC_IRQn                    = 83,       /*!< IOC interrupt                                                  */
    SPI2_IRQn                   = 84,       /*!< SPI2 global interrupt                                          */
    SPI3_IRQn                   = 85,       /*!< SPI3 global interrupt                                          */
    SPI4_IRQn                   = 86,       /*!< SPI4 global interrupt                                          */
    SPI5_IRQn                   = 87,       /*!< SPI5 global interrupt                                          */
    SPI6_IRQn                   = 88,       /*!< SPI6 global interrupt                                          */
    SPI7_IRQn                   = 89,       /*!< SPI7 global interrupt                                          */
    QSPI_IRQn                   = 90,       /*!< QUADSPI global interrupt                                       */
    USART3_IRQn                 = 91,       /*!< USART3 interrupt                                               */
    USART4_IRQn                 = 92,       /*!< USART4 interrupt                                               */
    USART5_IRQn                 = 93,       /*!< USART5 interrupt                                               */
    CAN2_WKUP_IRQn              = 94,       /*!< CAN2 wakeup through EXTI Line detection interrupt              */
    CAN3_WKUP_IRQn              = 95,       /*!< CAN3 wakeup through EXTI Line detection interrupt              */
    CAN4_WKUP_IRQn              = 96,       /*!< CAN4 wakeup through EXTI Line detection interrupt              */
    CAN5_WKUP_IRQn              = 97,       /*!< CAN5 wakeup through EXTI Line detection interrupt              */
    CAN6_WKUP_IRQn              = 98,       /*!< CAN6 wakeup through EXTI Line detection interrupt              */
    CAN7_WKUP_IRQn              = 99,       /*!< CAN7 wakeup through EXTI Line detection interrupt              */
    CAN2_Message_IRQn           = 100,      /*!< CAN2 Interrupt for message buffer                              */
    CAN2_IRQn                   = 101,      /*!< CAN2 Interrupt                                                 */
    CAN3_Message_IRQn           = 102,      /*!< CAN3 Interrupt for message buffer                              */
    CAN3_IRQn                   = 103,      /*!< CAN3 Interrupt                                                 */
    CAN4_Message_IRQn           = 104,      /*!< CAN4 Interrupt for message buffer                              */
    CAN4_IRQn                   = 105,      /*!< CAN4 Interrupt                                                 */
    CAN5_Message_IRQn           = 106,      /*!< CAN5 Interrupt for message buffer                              */
    CAN5_IRQn                   = 107,      /*!< CAN5 Interrupt                                                 */
    CAN6_Message_IRQn           = 108,      /*!< CAN6 Interrupt for message buffer                              */
    CAN6_IRQn                   = 109,      /*!< CAN6 Interrupt                                                 */
    CAN7_Message_IRQn           = 110,      /*!< CAN7 Interrupt for message buffer                              */
    CAN7_IRQn                   = 111,      /*!< CAN7 Interrupt                                                 */
    TIMER19_CC0_CC0N_IRQn       = 112,      /*!< TIMER19 capture compare CH0 and MCH0 interrupt                 */
    TIMER19_CC1_CC1N_IRQn       = 113,      /*!< TIMER19 capture compare CH1 and MCH1 interrupt                 */
    TIMER19_CC2_CC2N_IRQn       = 114,      /*!< TIMER19 capture compare CH2 and MCH2 interrupt                 */
    TIMER19_CC3_CC3N_IRQn       = 115,      /*!< TIMER19 capture compare CH3 and MCH3 interrupt                 */
    TIMER20_CC0_CC0N_IRQn       = 116,      /*!< TIMER20 capture compare CH0 and MCH0 interrupt                 */
    TIMER20_CC1_CC1N_IRQn       = 117,      /*!< TIMER20 capture compare CH1 and MCH1 interrupt                 */
    TIMER20_CC2_CC2N_IRQn       = 118,      /*!< TIMER20 capture compare CH2 and MCH2 interrupt                 */
    TIMER20_CC3_CC3N_IRQn       = 119,      /*!< TIMER20 capture compare CH3 and MCH3 interrupt                 */
    TIMER60_CC0_CC0N_IRQn       = 120,      /*!< TIMER60 capture compare CH0 and MCH0 interrupt                 */
    TIMER60_CC1_CC1N_IRQn       = 121,      /*!< TIMER60 capture compare CH1 and MCH1 interrupt                 */
    TIMER60_CC2_CC2N_IRQn       = 122,      /*!< TIMER60 capture compare CH2 and MCH2 interrupt                 */
    TIMER60_CC3_CC3N_IRQn       = 123,      /*!< TIMER60 capture compare CH3 and MCH3 interrupt                 */
    TIMER61_CC0_CC0N_IRQn       = 124,      /*!< TIMER61 capture compare CH0 and MCH0 interrupt                 */
    TIMER61_CC1_CC1N_IRQn       = 125,      /*!< TIMER61 capture compare CH1 and MCH1 interrupt                 */
    TIMER61_CC2_CC2N_IRQn       = 126,      /*!< TIMER61 capture compare CH2 and MCH2 interrupt                 */
    TIMER61_CC3_CC3N_IRQn       = 127,      /*!< TIMER61 capture compare CH3 and MCH3 interrupt                 */
    TIMER62_CC0_CC0N_IRQn       = 128,      /*!< TIMER62 capture compare CH0 and MCH0 interrupt                 */
    TIMER62_CC1_CC1N_IRQn       = 129,      /*!< TIMER62 capture compare CH1 and MCH1 interrupt                 */
    TIMER62_CC2_CC2N_IRQn       = 130,      /*!< TIMER62 capture compare CH2 and MCH2 interrupt                 */
    TIMER62_CC3_CC3N_IRQn       = 131,      /*!< TIMER62 capture compare CH3 and MCH3 interrupt                 */
    TIMER63_CC0_CC0N_IRQn       = 132,      /*!< TIMER64 capture compare CH0 and MCH0 interrupt                 */
    TIMER63_CC1_CC1N_IRQn       = 133,      /*!< TIMER64 capture compare CH1 and MCH1 interrupt                 */
    TIMER63_CC2_CC2N_IRQn       = 134,      /*!< TIMER64 capture compare CH2 and MCH2 interrupt                 */
    TIMER63_CC3_CC3N_IRQn       = 135,      /*!< TIMER64 capture compare CH3 and MCH3 interrupt                 */
    DMA0_Channel7_IRQn          = 136,      /*!< DMA0 Channel7 global interrupt                                 */
    DMA0_Channel8_IRQn          = 137,      /*!< DMA0 Channel8 global interrupt                                 */
    DMA0_Channel9_IRQn          = 138,      /*!< DMA0 Channel9 global interrupt                                 */
    DMA0_Channel10_IRQn         = 139,      /*!< DMA0 Channel10 global interrupt                                */
    DMA0_Channel11_IRQn         = 140,      /*!< DMA0 Channel11 global interrupt                                */
    DMA0_Channel12_IRQn         = 141,      /*!< DMA0 Channel12 global interrupt                                */
    DMA0_Channel13_IRQn         = 142,      /*!< DMA0 Channel13 global interrupt                                */
    DMA0_Channel14_IRQn         = 143,      /*!< DMA0 Channel14 global interrupt                                */
    DMA0_Channel15_IRQn         = 144,      /*!< DMA0 Channel15 global interrupt                                */
    DMA1_Channel5_IRQn          = 145,      /*!< DMA1 Channel5 global interrupt                                 */
    DMA1_Channel6_IRQn          = 146,      /*!< DMA1 Channel6 global interrupt                                 */
    DMA1_Channel7_IRQn          = 147,      /*!< DMA1 Channel7 global interrupt                                 */
    DMA1_Channel8_IRQn          = 148,      /*!< DMA1 Channel8 global interrupt                                 */
    DMA1_Channel9_IRQn          = 149,      /*!< DMA1 Channel9 global interrupt                                 */
    DMA1_Channel10_IRQn         = 150,      /*!< DMA1 Channel10 global interrupt                                */
    DMA1_Channel11_IRQn         = 151,      /*!< DMA1 Channel11 global interrupt                                */
    DMA1_Channel12_IRQn         = 152,      /*!< DMA1 Channel12 global interrupt                                */
    DMA1_Channel13_IRQn         = 153,      /*!< DMA1 Channel13 global interrupt                                */
    DMA1_Channel14_IRQn         = 154,      /*!< DMA1 Channel14 global interrupt                                */
    DMA1_Channel15_IRQn         = 155,      /*!< DMA1 Channel15 global interrupt                                */
    MCMUA_RX_IRQn               = 156,      /*!< MCMUA Receive full interrupt                                     */
    MCMUA_TX_IRQn               = 157,      /*!< MCMUA Transmit empty interrupt                                   */
    MCMUA_NORMAL_IRQn           = 158,      /*!< MCMUA NORMAL purpose interrupt                                  */
    MCMUB_RX_IRQn               = 159,      /*!< MCMUB Receive full interrupt                                     */
    MCMUB_TX_IRQn               = 160,      /*!< MCMUB Transmit empty interrupt                                   */
    MCMUB_NORMAL_IRQn           = 161,      /*!< MCMUB NORMAL purpose interrupt                                  */
    LIN0_IRQn                   = 162,      /*!< LIN0 interrupt                                                 */
    LIN1_IRQn                   = 163,      /*!< LIN1 interrupt                                                 */
    LIN2_IRQn                   = 164,      /*!< LIN2 interrupt                                                 */
    LIN3_IRQn                   = 165,      /*!< LIN3 interrupt                                                 */
    LIN4_IRQn                   = 166,      /*!< LIN4 interrupt                                                 */
    LIN5_IRQn                   = 167,      /*!< LIN5 interrupt                                                 */
    LIN6_IRQn                   = 168,      /*!< LIN6 interrupt                                                 */
    LIN7_IRQn                   = 169,      /*!< LIN7 interrupt                                                 */
    LIN8_IRQn                   = 170,      /*!< LIN8 interrupt                                                 */
    LIN9_IRQn                   = 171,      /*!< LIN9 interrupt                                                 */
    LIN10_IRQn                  = 172,      /*!< LIN10 interrupt                                                */
    LIN11_IRQn                  = 173,      /*!< LIN11 interrupt                                                */
    TIMER0_CC0_CC0N_IRQn        = 174,      /*!< TIMER0 Capture Compare CH0 and MCH0 interrupt                  */
    TIMER0_CC1_CC1N_IRQn        = 175,      /*!< TIMER0 Capture Compare CH1 and MCH1 interrupt                  */
    TIMER0_CC2_CC2N_IRQn        = 176,      /*!< TIMER0 Capture Compare CH2 and MCH3 interrupt                  */
    TIMER0_CC3_CC3N_IRQn        = 177,      /*!< TIMER0 Capture Compare CH4 and MCH4 interrupt                  */
    TIMER7_CC0_CC0N_IRQn        = 178,      /*!< TIMER7 Capture Compare CH0 and MCH0 interrupt                  */
    TIMER7_CC1_CC1N_IRQn        = 179,      /*!< TIMER7 Capture Compare CH1 and MCH1 interrupt                  */
    TIMER7_CC2_CC2N_IRQn        = 180,      /*!< TIMER7 Capture Compare CH2 and MCH3 interrupt                  */
    TIMER7_CC3_CC3N_IRQn        = 181,      /*!< TIMER7 Capture Compare CH4 and MCH4 interrupt                  */
    TIMER1_CC0_IRQn             = 182,      /*!< TIMER1 Capture Compare CH0 and MCH0 interrupt                  */
    TIMER1_CC1_IRQn             = 183,      /*!< TIMER1 Capture Compare CH1 and MCH1 interrupt                  */
    TIMER1_CC2_IRQn             = 184,      /*!< TIMER1 Capture Compare CH2 and MCH3 interrupt                  */
    TIMER1_CC3_IRQn             = 185,      /*!< TIMER1 Capture Compare CH4 and MCH4 interrupt                  */
    TIMER2_CC0_IRQn             = 186,      /*!< TIMER2 Capture Compare CH0 and MCH0 interrupt                  */
    TIMER2_CC1_IRQn             = 187,      /*!< TIMER2 Capture Compare CH1 and MCH1 interrupt                  */
    TIMER2_CC2_IRQn             = 188,      /*!< TIMER2 Capture Compare CH2 and MCH3 interrupt                  */
    TIMER2_CC3_IRQn             = 189,      /*!< TIMER2 Capture Compare CH4 and MCH4 interrupt                  */
    FWDGT_IRQn                  = 190,      /*!< FWDGT reset interrupt through EXTI Line detection interrupt    */
    ETH_IRQn                    = 191,      /*!< Ethernet0 global interrupt                                     */
    ETH_WKUP_IRQn               = 192,      /*!< Ethernet0 wakeup interrupt | Ethernet0 lpi interrupt           */
    ETH_TX_IRQn                 = 193,      /*!< Ethernet0 Tx0 / Tx1 interrupt                                  */
    ETH_RX_IRQn                 = 194,      /*!< Ethernet0 Rx0 / Rx1 interrupt                                  */
    ETH_SAFETY_IRQn             = 195,      /*!< Ethernet0 safety correctable / uncorrectable interrupt         */
    RCU_CK_FAIL_IRQn            = 196,      /*!< RCU clock fail interrupt                                       */
    CAN5_ECCERR_IRQn            = 197,      /*!< CAN5 ECC error interrupt                                       */
    TIMER60_BRK_UP_TRG_CMT_IRQn = 210,      /*!< TIMER60 Break, update, trigger and commutation, dec interrupt  */
    TIMER61_BRK_UP_TRG_CMT_IRQn = 211,      /*!< TIMER61 Break, update, trigger and commutation, dec interrupt  */
    TIMER62_BRK_UP_TRG_CMT_IRQn = 212,      /*!< TIMER62 Break, update, trigger and commutation, dec interrupt  */
    TIMER63_BRK_UP_TRG_CMT_IRQn = 213,      /*!< TIMER63 Break, update, trigger and commutation, dec interrupt  */
    TIMER5_CH0_UP_IRQn          = 214,      /*!< TIMER5 CH0 update interrupt                                    */
    TIMER5_CH1_UP_IRQn          = 215,      /*!< TIMER5 CH1 update interrupt                                    */
    TIMER5_CH2_UP_IRQn          = 216,      /*!< TIMER5 CH2 update interrupt                                    */
    TIMER5_CH3_UP_IRQn          = 217,      /*!< TIMER5 CH3 update interrupt                                    */
    TIMER6_CH0_UP_IRQn          = 218,      /*!< TIMER6 CH0 update interrupt                                    */
    TIMER6_CH1_UP_IRQn          = 219,      /*!< TIMER6 CH1 update interrupt                                    */
    TIMER6_CH2_UP_IRQn          = 220,      /*!< TIMER6 CH2 update interrupt                                    */
    TIMER6_CH3_UP_IRQn          = 221,      /*!< TIMER6 CH3 update interrupt                                    */
    CAN6_ECCERR_IRQn            = 238,      /*!< CAN6 ECC error interrupt                                       */
    CAN7_ECCERR_IRQn            = 239       /*!< CAN7 ECC error interrupt                                       */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)                                      */
} IRQn_Type;

/* includes */
#include "core_cm7.h"
#include "system_gd32a7xx.h"
#include <stdint.h>
#ifdef FW_DEBUG_ERR_REPORT
#include "gd32a7xx_err_report.h"
#endif /* FW_DEBUG_ERR_REPORT */

/* enum definitions */
typedef enum {DISABLE = 0, ENABLE = !DISABLE} EventStatus, ControlStatus;
typedef enum {RESET = 0, SET = !RESET} FlagStatus;
typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrStatus;

/* bit operations */
#define REG64(addr)                  (*(volatile uint64_t *)(uint32_t)(addr))
#define REG32(addr)                  (*(volatile uint32_t *)(uint32_t)(addr))
#define REG16(addr)                  (*(volatile uint16_t *)(uint32_t)(addr))
#define REG8(addr)                   (*(volatile uint8_t *)(uint32_t)(addr))
#define BIT(x)                       ((uint32_t)((uint32_t)0x01U<<(x)))
#define BITS(start, end)             ((0xFFFFFFFFUL << (uint8_t)(start)) & (0xFFFFFFFFUL >> (31U - (uint8_t)(end)))) 
#define GET_BITS(regval, start, end) (((regval) & BITS((start),(end))) >> (start))

