sorosaulong-ux/gd32-test-project/Library/gd32a7xx.h
/* main flash and SRAM memory map */
#define FLASH_BASE            ((uint32_t)0x08000000U)       /*!< main FLASH base address    */
#define SRAM_BASE             ((uint32_t)0x24000000U)       /*!< SRAM base address          */

/* peripheral memory map */
#define APB1_BUS_BASE         ((uint32_t)0x40000000U)       /*!< apb1 base address          */
#define APB2_BUS_BASE         ((uint32_t)0x4000F000U)       /*!< apb2 base address          */
#define AHB1_BUS_BASE         ((uint32_t)0x40020000U)       /*!< ahb1 base address          */
#define AHB2_BUS_BASE         ((uint32_t)0x48000000U)       /*!< ahb2 base address          */
#define AHB3_BUS_BASE         ((uint32_t)0x50010000U)       /*!< ahb3 base address          */

/* advanced peripheral bus 1 memory map */
#define TIMER_BASE            (APB1_BUS_BASE + 0x00000000U) /*!< TIMER base address         */
#define CLTCFG_BASE           (APB1_BUS_BASE + 0x00002400U) /*!< CLTCFG base address        */
#define RTC_BASE              (APB1_BUS_BASE + 0x00002800U) /*!< RTC base address           */
#define WWDGT_BASE            (APB1_BUS_BASE + 0x00002C00U) /*!< WWDGT base address         */
#define FWDGT_BASE            (APB1_BUS_BASE + 0x00003000U) /*!< FWDGT base address         */
#define SPI_BASE              (APB1_BUS_BASE + 0x00003800U) /*!< SPI base address           */
#define I2C_BASE              (APB1_BUS_BASE + 0x00005400U) /*!< I2C base address           */
#define BKP_BASE              (APB1_BUS_BASE + 0x00006C00U) /*!< BKP base address           */
#define PMU_BASE              (APB1_BUS_BASE + 0x00007000U) /*!< PMU base address           */
#define DAC_BASE              (APB1_BUS_BASE + 0x00007400U) /*!< DAC base address           */
#if  defined(GD32A714X) || defined(GD32A72XX) || defined (GD32A74XX)
#define SENT_BASE             (APB1_BUS_BASE + 0x00006000U) /*!< SENT base address          */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define LINFLEXD_BASE         (APB1_BUS_BASE + 0x00008800U) /*!< LIN base address           */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define ENET_BASE             (APB1_BUS_BASE + 0x0000A000U) /*!< ENET base address          */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define JDC_BASE              (APB1_BUS_BASE + 0x0000EC00U) /*!< JDC base address           */

/* advanced peripheral bus 2 memory map */
#define ADC_BASE              (APB2_BUS_BASE + 0x00000000U) /*!< ADC base address           */
#define SYSCFG_BASE           (APB2_BUS_BASE + 0x00001000U) /*!< SYSCFG base address        */
#define EXTI_BASE             (APB2_BUS_BASE + 0x00001400U) /*!< EXTI base address          */
#define TRIGSEL_BASE          (APB2_BUS_BASE + 0x00003000U) /*!< TRIGSEL base address       */
#define CMP_BASE              (APB2_BUS_BASE + 0x00007C00U) /*!< CMP base address           */
#define CAN_BASE              (APB2_BUS_BASE + 0x00009000U) /*!< CAN base address           */

/* advanced high performance bus 1 memory map */
#define FMU_BASE              (AHB1_BUS_BASE + 0x00003400U) /*!< FMU base address           */
#define IRM_BASE              (AHB1_BUS_BASE + 0x00003800U) /*!< IRM base address           */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define IOC_BASE              (AHB1_BUS_BASE + 0x00003C00U) /*!< IOC base address           */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define MTC_BASE              (AHB1_BUS_BASE + 0x00004400U) /*!< MTC base address           */
#define STCM_BASE             (AHB1_BUS_BASE + 0x00005000U) /*!< STCM base address          */
#define REGPRT_BASE           (AHB1_BUS_BASE + 0x00018000U) /*!< REGPRT base address        */
#define DBGSYS_BASE           (AHB1_BUS_BASE + 0x00220000U) /*!< DBGSYS base address        */

/* advanced high performance bus 2 memory map */
#define GPIO_BASE             (AHB2_BUS_BASE + 0x00000000U) /*!< GPIO base address          */
#define DMA_BASE              (AHB2_BUS_BASE + 0x01000000U) /*!< DMA base address           */
#define DMAMUX_BASE           (AHB2_BUS_BASE + 0x01000800U) /*!< DMAMUX base address        */
#define SRAMC_BASE            (AHB2_BUS_BASE + 0x01000C00U) /*!< SRAMC base address         */
#define RCU_BASE              (AHB2_BUS_BASE + 0x01001000U) /*!< RCU base address           */
#define QSPI_BASE             (AHB2_BUS_BASE + 0x01001400U) /*!< QSPI base address          */
#define FMC_BASE              (AHB2_BUS_BASE + 0x01002000U) /*!< FMC base address           */
#define CRC_BASE              (AHB2_BUS_BASE + 0x01003000U) /*!< CRC base address           */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define MFCOM_BASE            (AHB2_BUS_BASE + 0x01003400U) /*!< MFCOM base address         */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RMU_BASE              (AHB2_BUS_BASE + 0x01003C00U) /*!< RMU base address           */
#define TCMREG_BASE           (AHB2_BUS_BASE + 0x01004000U) /*!< TCMREG base address        */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define MCMU_BASE             (AHB2_BUS_BASE + 0x01008000U) /*!< MCMU base address          */
#define HWSEM_BASE            (AHB2_BUS_BASE + 0x01008800U) /*!< HWSEM base address         */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define HSMIF_BASE            (AHB2_BUS_BASE + 0x01008C00U) /*!< HSMIF base address         */
#define BUSIM_BASE            (AHB2_BUS_BASE + 0x01009000U) /*!< BUSIM base address         */
#define IMICU_BASE            (AHB2_BUS_BASE + 0x01009400U) /*!< IMICU base address         */
#define EXTMPU_BASE           (AHB2_BUS_BASE + 0x0100A000U) /*!< EXTMPU base address        */

/* advanced high performance bus 3 memory map */
#define SM2_BASE              (AHB3_BUS_BASE + 0x00010800U) /*!< SM2 base address           */
#define SM3_BASE              (AHB3_BUS_BASE + 0x00010C00U) /*!< SM3 base address           */
#define SM4_BASE              (AHB3_BUS_BASE + 0x00011000U) /*!< SM4 base address           */
#define PKCAU_BASE            (AHB3_BUS_BASE + 0x00011400U) /*!< PKCAU base address         */
#define CAU_BASE              (AHB3_BUS_BASE + 0x00050000U) /*!< CAU base address           */
#define HAU_BASE              (AHB3_BUS_BASE + 0x00050400U) /*!< HAU base address           */
#define TRNG_BASE             (AHB3_BUS_BASE + 0x00050800U) /*!< TRNG base address          */

/* option byte and debug memory map */
#define OB_BASE               ((uint32_t)0x1FFF8800U)       /*!< OB base address            */

#define DBG_BASE              ((uint32_t)0xE00E1000U)       /*!< DBG base address           */

/* define marco USE_STDPERIPH_DRIVER */
#if !defined  USE_STDPERIPH_DRIVER
#define USE_STDPERIPH_DRIVER
#endif 
#ifdef USE_STDPERIPH_DRIVER
#include "gd32a7xx_libopt.h"
#endif /* USE_STDPERIPH_DRIVER */

#ifdef __cplusplus
}
#endif

#endif /* GD32A7XX_H */
